#include "User.h"

CUser::CUser()
{
	m_strUserName = "";

	m_strPassWord = "";

	m_chRight = 0;
}

CUser::~CUser()
{
	
}


/******************************************************************
//函数功能说明：设置用户名
//参数说明:
//   pUserName 用户名
//返回值：无
******************************************************************/
void CUser::SetUserName(char *pUserName)
{
	//设置用户名
	if (pUserName != NULL)
	{
		m_strUserName = pUserName;
	}
}


/******************************************************************
//函数功能说明：得到用户名
//参数说明:
//   无
//返回值：当前用户的字符串
******************************************************************/
char* CUser::GetUsername(void)
{
	return (char *)m_strUserName.c_str();
}


/******************************************************************
//函数功能说明：设置密码
//参数说明:
//   pPassWord 密码
//返回值：无
******************************************************************/
void CUser::SetPassWord(char *pPassWord)
{
	//设置密码
	if (pPassWord != NULL)
	{
		m_strPassWord = pPassWord;
	}
}


/******************************************************************
//函数功能说明：得到密码
//参数说明:
//   无
//返回值：返回当前密码的字符串
******************************************************************/
char* CUser::GetPassWord(void)
{
	return (char *)m_strPassWord.c_str();
}


/******************************************************************
//函数功能说明：设置用户权限
//参数说明:
//   chRight
//返回值：无
******************************************************************/
void CUser::SetRight(char chRight)
{
	m_chRight = chRight;
}


/******************************************************************
//函数功能说明：得到用户权限
//参数说明:
//   无
//返回值：返回当前用户的权限
******************************************************************/
char CUser::GetRight(void) const
{
	return m_chRight;
}
