#if !defined USER_H_FILE_INCLUDE
#define USER_H_FILE_INCLUDE

#include <string>

using namespace std;
//用于存放用户名与密码，以及权限的一个类
class CUser
{
public:
	CUser();
	
	~CUser();

public:


	/******************************************************************
	//函数功能说明：得到用户名
	//参数说明:
	//   无
	//返回值：当前用户的字符串
	******************************************************************/
	char* GetUsername(void);


	/******************************************************************
	//函数功能说明：设置用户名
	//参数说明:
	//   pUserName 用户名
	//返回值：无
	******************************************************************/
	void SetUserName(char *pUserName);

	
	
	/******************************************************************
	//函数功能说明：设置密码
	//参数说明:
	//   pPassWord 密码
	//返回值：无
	******************************************************************/
	void SetPassWord(char *pPassWord);

	/******************************************************************
	//函数功能说明：得到密码
	//参数说明:
	//   无
	//返回值：返回当前密码的字符串
	******************************************************************/
	char* GetPassWord(void);
	
	/******************************************************************
	//函数功能说明：设置用户权限
	//参数说明:
	//   chRight
	//返回值：无
	******************************************************************/
	void SetRight(char chRight);

	/******************************************************************
	//函数功能说明：得到用户权限
	//参数说明:
	//   无
	//返回值：返回当前用户的权限
	******************************************************************/
	char GetRight(void) const;

private:
	//用户名
	string m_strUserName;

	//密码
	string m_strPassWord;
	
	//权限
	char m_chRight;
};

#endif
